; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_2 type_3)
 (:predicates (pred_3 ?v6 - type_2 ?v7 - type_1)
 	      (pred_4 ?v2 - object ?v7 - type_1)
	      (pred_1 ?v6 - type_2 ?v5 - type_3)
	      (pred_2 ?v6 - type_2 ?v2 - object ?v5 - type_3))

   (:action op_2
       :parameters  (?v6 - type_2 ?v3 ?v4 - type_1)
       :precondition (and  (pred_3 ?v6 ?v3))
       :effect (and  (pred_3 ?v6 ?v4)
		     (not (pred_3 ?v6 ?v3))))

   (:action op_3
       :parameters (?v6 - type_2 ?v8 - object ?v1 - type_1 ?v5 - type_3)
       :precondition  (and  (pred_4 ?v8 ?v1) (pred_3 ?v6 ?v1) (pred_1 ?v6 ?v5))
       :effect (and (pred_2 ?v6 ?v8 ?v5)
		    (not (pred_4 ?v8 ?v1)) 
		    (not (pred_1 ?v6 ?v5))))

   (:action op_1
       :parameters (?v6 - type_2 ?v8 - object ?v1 - type_1 ?v5 - type_3)
       :precondition  (and  (pred_2 ?v6 ?v8 ?v5) (pred_3 ?v6 ?v1))
       :effect (and (pred_4 ?v8 ?v1)
		    (pred_1 ?v6 ?v5)
		    (not (pred_2 ?v6 ?v8 ?v5)))))

; problem
(define (problem gripper-1-3-3)
(:domain gripper-strips)
(:objects obj_01 - type_2
obj_08 obj_06 - type_3
obj_07 obj_05 obj_03 - type_1
obj_04 obj_09 obj_02 - object)
(:init
(pred_3 obj_01 obj_07)
(pred_1 obj_01 obj_08)
(pred_1 obj_01 obj_06)
(pred_4 obj_04 obj_07)
(pred_4 obj_09 obj_07)
(pred_4 obj_02 obj_03)
)
(:goal
(and
(pred_4 obj_04 obj_05)
(pred_4 obj_09 obj_05)
(pred_4 obj_02 obj_03)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_2 obj_01 ?b obj_06))))
)
)

; plan
1. (op_3 obj_01 obj_04 obj_07 obj_08)
   deleted: (pred_4 obj_04 obj_07) (pred_1 obj_01 obj_08)
   added: (pred_2 obj_01 obj_04 obj_08)
   goals met: 1 of 3
2. (op_2 obj_01 obj_07 obj_05)
   deleted: (pred_3 obj_01 obj_07)
   added: (pred_3 obj_01 obj_05)
   goals met: 1 of 3
3. (op_1 obj_01 obj_04 obj_05 obj_08)
   deleted: (pred_2 obj_01 obj_04 obj_08)
   added: (pred_4 obj_04 obj_05) (pred_1 obj_01 obj_08)
   goals met: 2 of 3
4. (op_2 obj_01 obj_05 obj_07)
   deleted: (pred_3 obj_01 obj_05)
   added: (pred_3 obj_01 obj_07)
   goals met: 2 of 3
5. (op_3 obj_01 obj_09 obj_07 obj_08)
   deleted: (pred_4 obj_09 obj_07) (pred_1 obj_01 obj_08)
   added: (pred_2 obj_01 obj_09 obj_08)
   goals met: 2 of 3
6. (op_2 obj_01 obj_07 obj_05)
   deleted: (pred_3 obj_01 obj_07)
   added: (pred_3 obj_01 obj_05)
   goals met: 2 of 3
7. (op_1 obj_01 obj_09 obj_05 obj_08)
   deleted: (pred_2 obj_01 obj_09 obj_08)
   added: (pred_4 obj_09 obj_05) (pred_1 obj_01 obj_08)
   goals met: 3 of 3
